src/ex_Tabakon/Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Documents/ПоступлениеТоваров/Ext/ObjectModule.bsl
&Перед("ОбработкаПроверкиЗаполнения")
Процедура ТБКОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Марк 2025-01-22
	Если Найти(Комментарий, "Смена ИП") Тогда //поступление просто для остатков. сказано пофиг что будет тут указано
		
		Если НЕ Контрагент.Пустая() И Найти(Строка(Контрагент), "<Объект не найден>") или Контрагент.Пустая()Тогда 
			
			Запрос = Новый запрос("ВЫБРАТЬ
			                      |	Контрагенты.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	Справочник.Контрагенты КАК Контрагенты
			                      |ГДЕ
			                      |	Контрагенты.Наименование <> """"
			                      |	И Контрагенты.Поставщик
			                      |
			                      |УПОРЯДОЧИТЬ ПО
			                      |	Контрагенты.Наименование");
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда

				Контрагент = Выборка.Ссылка;	

			КонецЕсли;	
			
		КонецЕсли;

		Для каждого Строка Из Товары Цикл 
			
			//ндс не пересчитываю, поступление просто для остатков. сказано пофиг что будет тут указано
			Строка.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			
		КонецЦикла;	
		
	КонецЕсли;
	//КонецМарк
КонецПроцедуры

&После("ПриЗаписи")
Процедура ТБКПриЗаписи(Отказ)
	
	//Марк 2025-01-22
	////исправление <Объект не найден> +++ 
	//МассивНеНайденныхСсылок = Новый Массив;
	//мСоответствиеИдентификаторовТипов = Неопределено;
	//
	//Для каждого Строка Из Товары Цикл 
	//	
	//	Если НЕ Строка.Номенклатура.Пустая() И Найти(Строка(Строка.Номенклатура), "<Объект не найден>") Тогда
	//		Если Строка.Номенклатура.ПолучитьОбъект() = Неопределено Тогда
	//			МассивНеНайденныхСсылок.Добавить(ОбщегоНазначения.РасшифровкаПредставленияБитойСсылки(Строка(Строка.Номенклатура), мСоответствиеИдентификаторовТипов));	
	//		КонецЕсли;
	//	КонецЕсли;  
	//	
	//	Если НЕ Строка.Характеристика.Пустая() И Найти(Строка(Строка.Характеристика), "<Объект не найден>") Тогда
	//		Если Строка.Характеристика.ПолучитьОбъект() = Неопределено Тогда
	//			МассивНеНайденныхСсылок.Добавить(ОбщегоНазначения.РасшифровкаПредставленияБитойСсылки(Строка(Строка.Характеристика), мСоответствиеИдентификаторовТипов));		
	//		КонецЕсли;	
	//	КонецЕсли;
	//	
	//	Если НЕ Строка.Упаковка.Пустая() И Найти(Строка(Строка.Упаковка), "<Объект не найден>") Тогда
	//		Если Строка.Упаковка.ПолучитьОбъект() = Неопределено Тогда
	//			МассивНеНайденныхСсылок.Добавить(ОбщегоНазначения.РасшифровкаПредставленияБитойСсылки(Строка(Строка.Упаковка), мСоответствиеИдентификаторовТипов));	
	//		КонецЕсли;
	//	КонецЕсли; 
	//	
	//КонецЦикла;
	//
	//
	//Если ЗначениеЗаполнено(МассивНеНайденныхСсылок) Тогда
	//	
	//	эл = Новый Структура;
	//	эл.Вставить("Array_GUID", МассивНеНайденныхСсылок);
	//	эл.Вставить("Dokument_GUID", Строка(Ссылка.УникальныйИдентификатор())); 
	//	
	//	Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПроктиWStbk();
	//	
	//	Если Прокси <> Неопределено Тогда 
	//		
	//		Попытка
	//			JS = ОбщегоНазначения.СтруктураВjson_Общая(эл);
	//			Ответ = Прокси.RregistrationLinks(JS);	
	//		Исключение
	//			
	//		КонецПопытки;	
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	////исправление <Объект не найден> ---
	//КонецМарк
	
КонецПроцедуры
